<?php
if(isset($update->callback_query)){
  $chat_id = $update->callback_query->message->chat->id;
  $message_id = $update->callback_query->message->message_id;
  $data     = $update->callback_query->data;
 $user = $update->callback_query->from->username;

}
if($text == 'الاوامر'){
  bot('sendMessage',[
   'chat_id'=>$chat_id,
   'text'=>"
•●○●○●○●○●•ٴ
① الادمنيه
② للتفعيل،التعطيل،الرفع
③ الخدميات
④ اوامر المسح
⑤ اوامر الاعضاء
⑥ اومر التسليه
•●○●○●○●○●•ٴ
𝘊𝘩 - [جوجل🧞‍♂💙](https://t.me/KGTBM)",
'parse_mode'=>"MarkDown",
'disable_web_page_preview'=>true,
"reply_markup"=>json_encode([
     'inline_keyboard'=>[
[['text'=>"①",'callback_data'=>'1'],['text'=>"②",'callback_data'=>'2'],["text"=>"③","callback_data"=>"3"]],
[["text"=>"④","callback_data"=>"4"],['text'=>'⑤','callback_data'=>'5']],
[["text"=>"⑥","callback_data"=>"6"]],
[['text'=>"المطور",'url'=>"https://t.me/kgtbr"]],
      ]
    ])
  ]);
$sales['mode'] = null;
  save($sales);
 }
 if($data == "bk" ){
 bot('EditMessageText',[
   'chat_id'=>$chat_id,
   'message_id'=>$message_id,
   'text'=>"
•●○●○●○●○●•ٴ
① الادمنيه
② للتفعيل،التعطيل،الرفع
③ الخدميات
④ اوامر المسح
⑤ اوامر الاعضاء
⑥ اومر التسليه
•●○●○●○●○●•ٴ
𝘊𝘩 - [جوجل🧞‍♂💙](https://t.me/KGTBM)",
'parse_mode'=>"MarkDown",
'reply_to_message_id'=>$message->message_id, 
   'reply_markup'=>json_encode([
     'inline_keyboard'=>[
[['text'=>"①",'callback_data'=>'1'],['text'=>"②",'callback_data'=>'2'],["text"=>"③","callback_data"=>"3"]],
[["text"=>"④","callback_data"=>"4"],['text'=>'⑤','callback_data'=>'5']],
[["text"=>"⑥","callback_data"=>"6"]],
[['text'=>"المطور",'url'=>"https://t.me/kgtbr"]],
      ]
    ])
  ]);
 }
 if($data == '1' ){
  bot('editMessageText',[
    'chat_id'=>$chat_id,
    'message_id'=>$message_id,
    'text'=>"
1-❴اوامر الرفع والتنزيل للمنشئ الاساسي❵
⋆  ━━━  𝖕𝖚𝖑𝖘𝖊 𖠱²²  ━━━ ⋆
⋆⇽رفع منشى+تنزيل منشى 
⋆⇽رفع المدير+تنزيل المدير
⋆⇽رفع ادمن+تنزيل ادمن 
⋆⇽رفع مميز+تنزيل مميز 
⋆⇽تنزيل الكل:(تنزيل المميزين والمدراء والادمنيه بامر واحد)

2- ❴ اوامر مسح للمنشئيين  ❵ 

⋆⇽مسح المنشئيين=لمسح منشئيين 
⋆⇽مسح الادمنيه =لمسح الادمنيه 
⋆⇽مسح المميزين =لمسح المميزين 
⋆⇽مسح المدراء = لمسح المدراء 

3- ❴ آوآمـر آلحظـر وآلطــرد وآلتقييد ❵

⋆⇽حظر ❴بالرد+بالمعرف❵ لحظر العضو
⋆⇽الغاء الحظر ❴بالرد+بالمعرف❵ 
⋆⇽طرد ❴ بالرد+بالمعرف ❵ لطرد العضو
⋆⇽كتم ❴ بالرد+بالمعرف ❵ لكتم العضو
⋆⇽الغاء الكتم ❴بالرد+بالمعرف❵
⋆⇽تقييد❴بالرد+بالمعرف❵لتقييد العضو
⋆⇽فك التقييد ❴بالرد+بالمعرف❵
⋆⇽منع+الكلمه=لمنع كلمه بالمجموعه
⋆⇽الغاء منع = لالغاء منع الكلمه 
⋆  ━━━  𝖕𝖚𝖑𝖘𝖊 𖠱²²  ━━━ ⋆
𝘊𝘩 - [جوجل🧞‍♂💙](https://t.me/KGTBM)",
'parse_mode'=>"MarkDown",
'disable_web_page_preview'=>true,
"reply_markup"=>json_encode([
"inline_keyboard"=>[
[['text'=>"①",'callback_data'=>'1'],['text'=>"②",'callback_data'=>'2'],["text"=>"③","callback_data"=>"3"]],
[["text"=>"④","callback_data"=>"4"],['text'=>'⑤','callback_data'=>'5']],
[["text"=>"⑥","callback_data"=>"6"]],
[['text'=>"المطور",'url'=>"https://t.me/kgtbr"]],
]])
]);
}
if($data == '2' ){
  bot('editMessageText',[
    'chat_id'=>$chat_id,
    'message_id'=>$message_id,
    'text'=>"
1- ❪ اوامر الوضع للمجموعه ❫
  ⋆  ━━━  𝖕𝖚𝖑𝖘𝖊 𖠱²²  ━━━ ⋆
⋆⇽ضع الترحيب ⇜ لوضع ترحيب  
⋆⇽ضع القوانين ⇜ لوضع القوانين 
⋆⇽ضع وصف ⇜ لوضع وصف  
⋆⇽ضع رابط ⇜ لوضع الرابط  
⋆⇽الـرابـط ⇜ لعرض الرابط  

2- ❪ اوامر رؤية الاعدادات ❫

⋆⇽المنشئيين: لعرض المنشئيين 
⋆⇽الادمنيه: لعرض  الادمنيه 
⋆⇽المدراء: لعرض  الاداريين 
⋆⇽المكتومين: لعرض  المكتومين 
⋆⇽الحمايه: لعرض كل الاعدادات  
⋆⇽الوسائط: لعرض اعدادات الميديا 
⋆⇽القوانين: لعرض  القوانين 
⋆⇽الاعدادات: لعرض اعدادات المجموعه 
⋆⇽المجموعه: لعرض معلومات المجموعه
⋆⇽الوسائط » لمعرفه الاعدادات 
⋆⇽الاعدادات » عدادات المجموعه
⋆⇽سورس » سورس البوت
⋆⇽المطور » مطور البوت 
⋆  ━━━  𝖕𝖚𝖑𝖘𝖊 𖠱²²  ━━━ ⋆
𝘊𝘩 - [جوجل🧞‍♂💙](https://t.me/KGTBM)",
'parse_mode'=>"MarkDown",
'disable_web_page_preview'=>true,
"reply_markup"=>json_encode([
"inline_keyboard"=>[
[['text'=>"①",'callback_data'=>'1'],['text'=>"②",'callback_data'=>'2'],["text"=>"③","callback_data"=>"3"]],
[["text"=>"④","callback_data"=>"4"],['text'=>'⑤','callback_data'=>'5']],
[["text"=>"⑥","callback_data"=>"6"]],
[['text'=>"المطور",'url'=>"https://t.me/kgtbr"]],
]])
]);
}
if($data == '3' ){
  bot('editMessageText',[
    'chat_id'=>$chat_id,
    'message_id'=>$message_id,
    'text'=>"
⋆  ━━━  𝖕𝖚𝖑𝖘𝖊 𖠱²²  ━━━ ⋆
¹↫❬اوامر حمايـه المجموعه❭

⋆⇽قفل ⇽ فتح ❬الكـــل❭
⋆⇽قفل ⇽ فتح ❬التـاك❭
⋆⇽قفل ⇽ فتح ❬الفيـديـــو❭
⋆⇽قفل ⇽ فتح ❬الصــــــــور❭
⋆⇽قفل ⇽ فتح ❬الملصقات❭
⋆⇽قفل ⇽ فتح ❬المتحركه❭
⋆⇽قفل ⇽ فتح ❬البصمــات❭
⋆⇽قفل ⇽ فتح ❬الدردشـــه❭
⋆⇽قفل ⇽ فتح ❬الــروابـــط❭
⋆⇽قفل ⇽ فتح ❬البـــوتــات❭
⋆⇽قفل ⇽ فتح ❬التعــديــل❭
⋆ ⇽قفل ⇽ فتح ❬المعرفــات❭
⋆⇽قفل ⇽ فتح ❬الكـــلايـش❭
⋆ ️⇽قفل ⇽ فتح ❬التـــكـــــرار❭
⋆⇽قفل ⇽ فتح ❬الجــهـــــات❭
⋆⇽قفل ⇽ فتح ❬الانـــلايــن❭
⋆⇽قفل ⇽ فتح ❬التوجيــــه❭
⋆⇽قفل ⇽ فتح ❬الدخول بالرابط❭
⋆⇽قفل ⇽ فتح ❬البوتات بالطرد❭

²↫❬القفل بالتقييـد❭
                                                                               
⋆⇽قفل ⇽ فتح ❬الــصــــــور بالتقييـد❭
⋆⇽قفل ⇽ فتح ❬الــروابــط بالتقييـد❭
⋆⇽قفل ⇽ فتح ❬المتحركه بالتقييـد❭
⋆⇽قفل ⇽ فتح ❬الفيـــديــو بالتقييد❭
⋆⇽قفل ⇽ فتح ❬التوجيــه بالتقييــد❭ 
⋆  ━━━  𝖕𝖚𝖑𝖘𝖊 𖠱²²  ━━━ ⋆
𝘊𝘩 - [جوجل🧞‍♂💙](https://t.me/KGTBM)",
'parse_mode'=>"MarkDown",
'disable_web_page_preview'=>true,
"reply_markup"=>json_encode([
"inline_keyboard"=>[
[['text'=>"①",'callback_data'=>'1'],['text'=>"②",'callback_data'=>'2'],["text"=>"③","callback_data"=>"3"]],
[["text"=>"④","callback_data"=>"4"],['text'=>'⑤','callback_data'=>'5']],
[["text"=>"⑥","callback_data"=>"6"]],
[['text'=>"المطور",'url'=>"https://t.me/kgtbr"]],
]])
]);
}
if($data == '4' ){
  bot('editMessageText',[
    'chat_id'=>$chat_id,
    'message_id'=>$message_id,
    'text'=>"
⋆⇽اوامر الخدمه  
⋆  ━━━  𝖕𝖚𝖑𝖘𝖊 𖠱²²  ━━━ ⋆
⋆⇽ايدي ⇜ لعرض صورتك + معلوماتك 
⋆⇽ايديي ⇜ لعرض ايديك 
⋆⇽ايدي بالرد ⇜ لعرض ايدي الشخص 
⋆⇽جهاتي ⇜ لمعرفه عدد جهاتك 
⋆⇽الرابط ⇜ لسخراج رابط المجموعه
⋆⇽معلوماتي ⇜ لعرض معلوماتك 
⋆⇽الالعاب ⇜ لعرض العاب البوت 
⋆⇽رموز ببجي ⇜ لعرض رموز بابجي
⋆⇽اغاني ⇜ لعرض قائمه الاغاني
⋆⇽الافلام ⇜ لعرض افلام البوت
⋆⇽الابراج ⇜ لعرض الابراج ومعرفه توقات برجك 
⋆⇽نقاطي ⇜ لمعرفه عدد نقاطك
⋆⇽بيع نقاطي + العدد ⇜ لبيع نقاطك 
⋆⇽السورس ⇜ لعرض سورس البوت 
⋆⇽الرتبه بالرد ⇜ لمعرفه رتبة الشخص
⋆⇽التفاعل+المعرف ⇜تفاعل الشخص 
⋆⇽كشف بالرد ⇜ معلومات حسابه
⋆⇽كشف بالمعرف ⇜ معلومات حسابه 
⋆⇽طرد البوتات ⇜ لطرد كل البوتات
⋆⇽طرد المحذوفين ⇜ لطرد المحذوفين
⋆⇽كشف البوتات ⇜ عدد البوتات 
⋆⇽رابط الحذف ⇜ لحذف حسابك
⋆  ━━━  𝖕𝖚𝖑𝖘𝖊 𖠱²²  ━━━ ⋆
𝘊𝘩 - [جوجل🧞‍♂💙](https://t.me/KGTBM)",
'parse_mode'=>"MarkDown",
'disable_web_page_preview'=>true,
"reply_markup"=>json_encode([
"inline_keyboard"=>[
[['text'=>"①",'callback_data'=>'1'],['text'=>"②",'callback_data'=>'2'],["text"=>"③","callback_data"=>"3"]],
[["text"=>"④","callback_data"=>"4"],['text'=>'⑤','callback_data'=>'5']],
[["text"=>"⑥","callback_data"=>"6"]],
[['text'=>"المطور",'url'=>"https://t.me/kgtbr"]],
]])
]);
}
if($data == '5' ){
  bot('editMessageText',[
    'chat_id'=>$chat_id,
    'message_id'=>$message_id,
    'text'=>"
⚜⇽ اوامر الردود 
⋆  ━━━  𝖕𝖚𝖑𝖘𝖊 𖠱²²  ━━━ ⋆
⋆⇽الردود ⇜ لعرض الردود المثبته
⋆ ⇽اضف رد ⇜ لأضافه رد جديد
⋆ ⇽مسح رد  ⇜ الرد المراد مسحه
⋆ ⇽مسح الردود ⇜ لمسح كل الردود
⋆ ⇽الردود العامه ⇜ لمعرف الردود المثبته عام 
⋆ ⇽اضف رد عام ⇜ لاضافه رد لكل المجموعات
⋆ ⇽مسح رد عام ⇜ لمسح الرد العام 
⋆⇽مسح الردود العامه ⇜ لمسح كل ردود العامه

❴ التفعيل و التعطيل ❵

⋆⇽تفعيل ⇽ تعطيل  ❬ التحويل ❭
⋆⇽تفعيل ⇽ تعطيل  ❬ اليوتيوب ❭
⋆⇽تفعيل ⇽ تعطيل  ❬ الرفــع ❭
⋆⇽تفعيل ⇽ تعطيل  ❬ الردود ❭
⋆⇽تفعيل ⇽ تعطيل  ❬الالعـاب❭
⋆⇽تفعيل ⇽ تعطيل  ❬ التحذير ❭
⋆⇽تفعيل ⇽ تعطيل  ❬ الترحيب ❭
⋆ ⇽تفعيل ⇽ تعطيل  ❬ الايدي ❭
⋆⇽تفعيل ⇽ تعطيل  ❬ الايدي بالصوره ❭
⋆  ━━━  𝖕𝖚𝖑𝖘𝖊 𖠱²²  ━━━ ⋆
𝘊𝘩 - [جوجل🧞‍♂💙](https://t.me/KGTBM)",
'parse_mode'=>"MarkDown",
'disable_web_page_preview'=>true,
"reply_markup"=>json_encode([
"inline_keyboard"=>[
[['text'=>"①",'callback_data'=>'1'],['text'=>"② ",'callback_data'=>'2'],["text"=>"③","callback_data"=>"3"]],
[["text"=>"④","callback_data"=>"4"],['text'=>'⑤','callback_data'=>'5']],
[["text"=>"⑥","callback_data"=>"6"]],
[['text'=>"المطور",'url'=>"https://t.me/kgtbr"]],
]])
]);
}
if($data == '6' ){
  bot('editMessageText',[
    'chat_id'=>$chat_id,
    'message_id'=>$message_id,
    'text'=>"
⋆⇽❬ آوآمر التسليه❭
⋆⇽مرحبآ عزيزي ،
⋆⇽إليـك اوامر التسليه كـ التالي
⋆  ━━━  𝖕𝖚𝖑𝖘𝖊 𖠱²²  ━━━ ⋆
⋆⇽رفع ⇽ تنزيل ❬ ثور ❭
⋆⇽رفع ⇽ تنزيل ❬ كيكه ❭
⋆⇽رفع ⇽ تنزيل ❬ متوحده ❭
⋆⇽رفع ⇽ تنزيل ❬ ذبانه ❭
⋆⇽رفع ⇽ تنزيل ❬ مزه ❭
⋆⇽رفع ⇽ تنزيل ❬ وتكه ❭
⋆⇽رفع ⇽ تنزيل ❬ خول ❭
⋆⇽رفع ⇽ تنزيل ❬ خرا ❭
⋆⇽رفع ⇽ تنزيل ❬ حمار ❭
⋆⇽رفع ⇽ تنزيل ❬ قرد ❭
⋆⇽رفع ⇽ تنزيل ❬ بقره ❭
⋆⇽رفع ⇽ تنزيل ❬ عره ❭
⋆⇽رفع ⇽ تنزيل ❬ كلب ❭
⋆⇽رفع ⇽ ❬ قلبي ❭ تنزيل ⇽ ❬ قلبي❭
⋆⇽❬ طلاق ❭ ⇽ ❬ زواج ❭
⋆  ━━━  𝖕𝖚𝖑𝖘𝖊 𖠱²²  ━━━ ⋆
𝘊𝘩 - [جوجل🧞‍♂💙](https://t.me/KGTBM)",
'parse_mode'=>"MarkDown",
'disable_web_page_preview'=>true,
"reply_markup"=>json_encode([
"inline_keyboard"=>[
[['text'=>"①",'callback_data'=>'1'],['text'=>"②",'callback_data'=>'2'],["text"=>"③","callback_data"=>"3"]],
[["text"=>"④","callback_data"=>"4"],['text'=>'⑤','callback_data'=>'5']],
[["text"=>"⑥","callback_data"=>"6"]],
[['text'=>"المطور",'url'=>"https://t.me/kgtbr"]],
]])
]);
}